#Задание 9. Ролики
#Что нужно сделать
#Частная контора даёт в прокат ролики самых разных размеров. Человек может надеть ролики только своего размера.

#Пользователь вводит два списка размеров: N размеров роликов и K размеров ног людей. Реализуйте код, который определяет, какое наибольшее число человек может одновременно взять ролики и пойти кататься.

#Пример:

#Количество роликов: 4
#Размер пары 1: 41
#Размер пары 2: 40
#Размер пары 3: 39
#Размер пары 4: 42

#Количество людей: 3
#Размер ноги человека 1: 42
#Размер ноги человека 2: 41
#Размер ноги человека 3: 42
#Наибольшее количество людей, которые могут взять ролики: 2