#Задача 3. /cats
#Что нужно сделать
#Создайте страницу с названием случайной породы кошек из следующего списка: корниш-рекс, русская голубая, шотландская вислоухая, мейн-кун, манчкин.

#Советы и рекомендации
#Для получения случайного значения из списка можно воспользоваться функцией choice из модуля random.
#Чтобы каждый раз не пересоздавать список пород при обращении к адресу /cats, следует вынести его в глобальную область видимости. Так можно добавлять новые породы и радовать этим пользователей.